# (№ 7638) Исполнитель Черепаха действует на плоскости с декартовой системой координат. 
# В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. 
# При опущенном хвосте Черепаха оставляет на поле след в виде линии. 
# В каждый конкретный момент известно положение исполнителя и направление его движения. 
# У исполнителя существует 6 команд: Поднять хвост, означающая переход к перемещению без рисования; 
# Опустить хвост, означающая переход в режим рисования; 
# Вперёд n (где n – целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова; 
# Назад n (где n – целое число), вызывающая передвижение в противоположном голове направлении; 
# Направо m (где m – целое число), вызывающая изменение направления движения на m градусов по часовой стрелке, 
# Налево m (где m – целое число), вызывающая изменение направления движения на m градусов против часовой стрелки.
# Запись
# Повтори k [Команда1 Команда2 … КомандаS]
# означает, что последовательность из S команд повторится k раз. 
# Черепахе был дан для исполнения следующий алгоритм:
# Повтори 9 [Вперёд 12 Направо 90 Вперёд 6 Направо 90]
# Поднять хвост
# Вперёд 1 Направо 90 Вперёд 3 Налево 90
# Опустить хвост
# Повтори 9 [Вперёд 53 Направо 90 Вперёд 75 Направо 90]
# Определите периметр области пересечения фигур, ограниченных заданными алгоритмом линиями.

from turtle import *

tracer(0)
r = 25
screensize(10000, 10000)

for i in range(9):
    fd(12 * r)
    rt(90)
    fd(6 * r)
    rt(90)
up()
fd(r)
rt(90)
fd(3 * r)
lt(90)
down()
for i in range(9):
    fd(53 * r)
    rt(90)
    fd(75 * r)
    rt(90)
up()
for x in range(-100, 100):
    for y in range(-100, 100):
        goto(x * r, y * r)
        dot(3, 'blue')
update()
exitonclick()
    